app/Views/peminjaman/v_pengajuan_diterima.php


foreach ($pengajuanditerima as $key => $value) {

    $buku = $db->table('tbl_peminjaman')
        ->join('tbl_buku', 'tbl_buku.id_buku = tbl_peminjaman.id_buku', 'left')
        ->where('id_anggota', $value['id_anggota'])
        ->where('status', 'Diterima')
        ->get()->getResultArray();
---
SELECT *
FROM `tbl_peminjaman`
LEFT JOIN `tbl_buku` ON `tbl_buku`.`id_buku` = `tbl_peminjaman`.`id_buku`
WHERE `id_anggota` = '1'
AND `status` = 'Diterima'