app/Views/peminjaman/v_pengajuan_masuk.php

SELECT *
FROM `tbl_peminjaman`
LEFT JOIN `tbl_buku` ON `tbl_buku`.`id_buku` = `tbl_peminjaman`.`id_buku`
WHERE `id_anggota` = '5'
AND `status` = 'Diajukan'
---

foreach ($pengajuanmasuk as $key => $value) {

    $buku = $db->table('tbl_peminjaman')
        ->join('tbl_buku', 'tbl_buku.id_buku = tbl_peminjaman.id_buku', 'left')
        ->where('id_anggota', $value['id_anggota'])
        ->where('status', 'Diajukan')
        ->get()->getResultArray();