app/Models/ModelPeminjaman.php

    public function PengajuanMasuk()
    {
        return $this->db->table('tbl_peminjaman')
            ->join('tbl_anggota', 'tbl_anggota.id_anggota = tbl_peminjaman.id_anggota', 'left')
            ->join('tbl_kelas', 'tbl_kelas.id_kelas = tbl_anggota.id_kelas', 'left')
            ->where('status', 'Diajukan')
            ->selectCount('tbl_peminjaman.id_anggota', 'qty')
            ->select('tbl_anggota.id_anggota,tbl_anggota.nis,tbl_anggota.nama_siswa,tbl_anggota.foto,tbl_kelas.nama_kelas')
            ->groupBy('tbl_peminjaman.id_anggota')
            ->get()->getResultArray();
---
SELECT COUNT(`tbl_peminjaman`.`id_anggota`) AS `qty`, `tbl_anggota`.`id_anggota`, `tbl_anggota`.`nis`, `tbl_anggota`.`nama_siswa`, `tbl_anggota`.`foto`, `tbl_kelas`.`nama_kelas`
FROM `tbl_peminjaman`
LEFT JOIN `tbl_anggota` ON `tbl_anggota`.`id_anggota` = `tbl_peminjaman`.`id_anggota`
LEFT JOIN `tbl_kelas` ON `tbl_kelas`.`id_kelas` = `tbl_anggota`.`id_kelas`
WHERE `status` = 'Diajukan'
GROUP BY `tbl_peminjaman`.`id_anggota`

    public function PengajuanDiterima()
    {
        return $this->db->table('tbl_peminjaman')
            ->join('tbl_anggota', 'tbl_anggota.id_anggota = tbl_peminjaman.id_anggota', 'left')
            ->join('tbl_kelas', 'tbl_kelas.id_kelas = tbl_anggota.id_kelas', 'left')
            ->where('status', 'Diterima')
            ->selectCount('tbl_peminjaman.id_anggota', 'qty')
            ->select('tbl_anggota.id_anggota,tbl_anggota.nis,tbl_anggota.nama_siswa,tbl_anggota.foto,tbl_kelas.nama_kelas')
            ->groupBy('tbl_peminjaman.id_anggota')
            ->get()->getResultArray();
---
SELECT COUNT(`tbl_peminjaman`.`id_anggota`) AS `qty`, `tbl_anggota`.`id_anggota`, `tbl_anggota`.`nis`, `tbl_anggota`.`nama_siswa`, `tbl_anggota`.`foto`, `tbl_kelas`.`nama_kelas`
FROM `tbl_peminjaman`
LEFT JOIN `tbl_anggota` ON `tbl_anggota`.`id_anggota` = `tbl_peminjaman`.`id_anggota`
LEFT JOIN `tbl_kelas` ON `tbl_kelas`.`id_kelas` = `tbl_anggota`.`id_kelas`
WHERE `status` = 'Diterima'
GROUP BY `tbl_peminjaman`.`id_anggota`