app/Models/ModelPengaturan.php

SELECT *
FROM `tbl_slider`
ORDER BY `id_slider` ASC
---
    public function Slider()
    {
        return $this->db->table('tbl_slider')
            ->orderBy('id_slider', 'ASC')
            ->get()->getResultArray();