app/Models/ModelAdmin.php

    public function TotalAnggota()
    {
        return $this->db->table('tbl_anggota')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tbl_anggota`

    public function TotalBuku()
    {
        return $this->db->table('tbl_buku')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tbl_buku`

    public function TotalEbook()
    {
        return $this->db->table('tbl_ebook')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tbl_ebook`