app/Views/v_template.php

<body class="hold-transition layout-top-nav">
  <?php
  $db = \Config\Database::connect();
  $web = $db->table('tbl_web')
      ->where('id_web', '1')
      ->get()->getRowArray();
---
SELECT *
FROM `tbl_web`
WHERE `id_web` = '1'